In [1]:
import pandas as pd

In [4]:
khms_roster_df = pd.read_csv('Resources/KHMS_Student_Roster.csv')
khms_roster_df.head()

   Student_number first_name last_name  grade_level
0           75454      David    Acosta            6
1           75604     Robert    Alfaro            6
2           75585     Yeremy  Alvarado            6
3           75511     Lizett     Amaya            6
4           75603    Anthony     Anaya            6

In [6]:
khms_roster_df["Name"] = khms_roster_df["last_name"] + ", " + khms_roster_df["first_name"]

In [11]:
khms_roster_df=khms_roster_df.drop(['first_name', 'last_name'], axis = 1)

In [12]:
khms_roster_df.head()

   Student_number  grade_level              Name
0           75454            6     Acosta, David
1           75604            6    Alfaro, Robert
2           75585            6  Alvarado, Yeremy
3           75511            6     Amaya, Lizett
4           75603            6    Anaya, Anthony

<h2> Exporting csv </h2>

In [13]:
khms_roster_df.to_csv('Resources/clean_student_roster', index = False)